<?php
// 8
// for ($i = 1; $i <= 9; $i++) {
// 	echo "2 x " . $i . " = " . $i * 2 . "\n";
// }

// 9
$arr = [
	1,
	2,
	3,
	4,
	5,
	6,
	7,
	8,
	9,
	10
];
function sosu($arr)
{
	// 자기 자신과 1
	// 
}

// (체스)룩 배치 시험
// k = 룩 개수
// n = 가로 길이 (그럼 총 칸은 n^2)
// 룩은 행열이 같으면 안됨
// 그럼 k와 n을 줬을 때 둘 수 있는 경우의 수는?

// | | |o|
// |x| | |  가능
// | | | |
// ---------------
// | | | |
// |x| |o|  불가능
// | | | |

// ex) n = 2, k = 2 => 2
// n = 3, k = 2 => 18

function rook($k, $n)
{
	$ans = 0;
	if ($n > $k) {
		// $ans = 1;
		// while(true){
		// 	$ans *= $n;
		// 	$n--;
		// 	if($n === 0){
		// 		break;
		// 	}
		// }
		for ($i = 1; $i <= ($n - $k) + 1; $i++) {
			for ($j = 1; $j <= $k - 1; $j++) {
				$ans += $n - $j;
			}
			$ans += pow($n - $k, 2);
		}
	} else {
		while (true) {
			$ans += $n * pow($n - 1, 2);
			$n--;
			if ($n < 1) {
				break;
			}
		}
	}

	return $ans;
}

echo rook(3, 5);

// rook(2, 4)
// |o| | | | 4 * 9 = 36
// | |o| | | 4 * 6 = 24
// | | |o| | 4 * 3 = 12
// | | | |o|         72

// rook(3, 4)
// | | | | | 4 * 9 = 36
// | | | | | 4 * 9 = 36
// | | | | | 4 * 9 = 36
// | | | | | 4 * 9 = 36
//           2 * 6 = 12
//           2 * 6 = 12
//           2 * 6 = 12
//           2 * 6 = 12
//                    8
//                   24
//                   4
//                  12
//                  192