<?php

//첫번째
// for($i=1;$i<=10;$i++){
// 	echo $i,"\n";
// }

//두번째
// $b;
// for($a=1;$a<10;$a++){
// 	echo $b=$a*2,"\n";
// }


//자습
// $c=sqrt($a);
// for($a=2;$a<700;$a*=2){
// 	printf( "%.3f\n",$c);
// }
//자습2
// for($a=2;$a<700;$a*=2){
// 	echo $a," - ", sqrt($a),"\n";
// }

// break 이거 if 구문 안에서 가능 ******DB에서 좀 씀

// continue 스킵 ******DB에서 좀 씀
// for($i=1;$i<=10;$i++){
// 	echo $i,"\n";
// 	continue; // 이 밑으로 스킵
// 	echo "55";
// }


//이중 루프

// for($i=0;$i<2;$i++){
// 	for($j=9;$j>7;$j--){
// 		echo "{$i} - {$j}\n";
// 	}
// }


// 이중루프활용

// for($a=1;$a<10;$a++){
// 	for($d=1;$d<10;$d++){
// 		$e = $a*$d;
// 		echo "$a x $d = $e\n";
// 	}
// }


// 활용2

// for($a=1;$a<10;$a++){
// 	if($a>1 && $a<9){
// 		continue;
// 	}
// 	else{
// 		for($d=1;$d<10;$d++){
// 			$e = $a*$d;
// 			echo "$a x $d = $e\n";
// 		}
// 	}
// }
// 2-2
// for($a=1;$a<10;$a+=8){
// 	for($d=1;$d<10;$d++){
// 		$e = $a*$d;
// 		echo "$a x $d = $e\n";
// 	}
// }

//활용3

for( $a = 1; $a < 10; $a++ ) {
	if( $a % 2 == 0 ) {
		for( $d = 1; $d < 10; $d++ ){
			$e = $a * $d;
			echo "{$a} x {$d} = {$e} \n";
		}
	}	
}